app/controllers/user_controller.rb

  def authenticate
		#User.new(params[:userform]) will create a new object of User, retrieve values from the form and store it variable @user.
		@user = User.new(params[:userform])
        #find records with username,password
		valid_user = User.find(:first,:conditions => ["username = ? and password = ?",@user.username, @user.password])
---
SELECT * FROM `users` WHERE (username = 'admin' and password = 'admin') LIMIT 1